In [2]:
import pandas as pd

In [5]:
tabela = pd.read_csv('../data/aulas/Matriculados.csv', delimiter= ";")

In [6]:
tabela.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [7]:
colunas = ['nome', 'peso']

In [10]:
colunas

['nome', 'peso']

In [8]:
tabela[colunas]

    nome  peso
0  Maria    71
1  Pedro    33
2  Pablo    90
3  Joana    58

In [9]:
tabela.iloc[:,:]

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [19]:
tabela.iloc[1:,:]

    nome  idade  peso altura sexo  n_filhos
1  Pedro      8    33    1,2    M         0
2  Pablo     46    90    1,9    M         1
3  Joana     83    58   1,54    F         2

In [20]:
tabela.iloc[1:3,:]

    nome  idade  peso altura sexo  n_filhos
1  Pedro      8    33    1,2    M         0
2  Pablo     46    90    1,9    M         1

In [21]:
tabela.iloc[1:2,:]

    nome  idade  peso altura sexo  n_filhos
1  Pedro      8    33    1,2    M         0

In [22]:
tabela.iloc[2:,:]

    nome  idade  peso altura sexo  n_filhos
2  Pablo     46    90    1,9    M         1
3  Joana     83    58   1,54    F         2

In [23]:
tabela.iloc[:,:3]

    nome  idade  peso
0  Maria     20    71
1  Pedro      8    33
2  Pablo     46    90
3  Joana     83    58

In [24]:
tabela.iloc[1:3,1:3]

   idade  peso
1      8    33
2     46    90

In [28]:
n_filhos = [0, 0, 1, 2]

In [29]:
n_filhos

[0, 0, 1, 2]

In [30]:
tabela['n_filhos'] = n_filhos
tabela.head()

    nome  idade  peso altura sexo  n_filhos
0  Maria     20    71   1,64    F         0
1  Pedro      8    33    1,2    M         0
2  Pablo     46    90    1,9    M         1
3  Joana     83    58   1,54    F         2

In [25]:
tabela.drop(['n_filhos'], axis=0)

KeyError: "['n_filhos'] not found in axis"

In [31]:
tabela.drop(['n_filhos'], axis=1)

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [32]:
tabela.head()

    nome  idade  peso altura sexo  n_filhos
0  Maria     20    71   1,64    F         0
1  Pedro      8    33    1,2    M         0
2  Pablo     46    90    1,9    M         1
3  Joana     83    58   1,54    F         2

In [29]:
tabela2 = tabela.drop(['n_filhos'], axis=1)
tabela2.head()

KeyError: "['n_filhos'] not found in axis"

In [33]:
tabela.drop(['n_filhos'], axis=1, inplace=True)
tabela.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F